# GetAssociatedZoneEquipment Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ZoneEquipment..::..GetAssociatedZoneEquipment Method
ZoneEquipment Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAssociatedZoneEquipment(Document, ElementId) | Gets the associated zone equipment of the specified analytical space. |
| GetAssociatedZoneEquipment(Document, ISet<(Of <<'(ElementId>)>>)) | Gets the associated zone equipment of all specified analytical spaces. |

# See Also
ZoneEquipment Class
ZoneEquipment Members
Autodesk.Revit.DB.Mechanical Namespace